user-friendly-name=Backend
user-friendly-plural-name=Backends
synopsis=Les backends sont responsables de l'acc\u00e8s aux donn\u00e9es sous-jacentes pr\u00e9sent\u00e9es par le serveur.
description=Les donn\u00e9es peuvent \u00eatre stock\u00e9es\u00a0: localement dans une base de donn\u00e9es incorpor\u00e9e, \u00e0 distance dans un syst\u00e8me externe, ou g\u00e9n\u00e9r\u00e9es \u00e0 la vol\u00e9e (par exemple, calcul\u00e9es \u00e0 partir d'autres informations disponibles).
property.backend-id.synopsis=Sp\u00e9cifie un nom pour identifier le backend correspondant.
property.backend-id.description=Le nom doit \u00eatre unique parmi tous les backends dans le serveur. L'ID de backend peut ne pas \u00eatre affect\u00e9 apr\u00e8s que le backend a \u00e9t\u00e9 cr\u00e9\u00e9 dans le serveur.
property.base-dn.synopsis=Sp\u00e9cifie le ou les DN de base pour les donn\u00e9es que g\u00e8re le backend.
property.base-dn.description=Un backend unique peut \u00eatre responsable d''un ou plusieurs des DN de base. Remarque\u00a0: deux backends ne peuvent avoir les m\u00eames DN de base bien qu'un backend puisse avoir un DN de base qui est sous un DN de base fourni par un autre backend (similaire \u00e0 l'utilisation de sous-suffixes dans Sun Java System Directory Server). Si un DN de base quelconque est subordonn\u00e9 \u00e0 un DN de base pour un autre backend, tous les DN de base pour ce backend doivent \u00eatre subordonn\u00e9s \u00e0 ce m\u00eame DN de base.
property.base-dn.requires-admin-action.synopsis=Aucune action administrative n'est requise par d\u00e9faut bien qu'une action puisse \u00eatre requise pour chaque backend avant que le nouveau DN de base puisse \u00eatre utilis\u00e9.
property.enabled.synopsis=Indique si le backend est activ\u00e9 dans le serveur.
property.enabled.description=Si un backend n'est pas activ\u00e9, son contenu n'est pas accessible lors du traitement des op\u00e9rations.
property.java-class.synopsis=Sp\u00e9cifie le nom complet de la classe Java qui fournit l'impl\u00e9mentation du backend.
property.writability-mode.synopsis=Sp\u00e9cifie le comportement que le backend doit utiliser lors du traitement des op\u00e9rations en \u00e9criture.
property.writability-mode.syntax.enumeration.value.disabled.synopsis=Entra\u00eene un \u00e9chec de toutes les tentatives d'\u00e9criture.
property.writability-mode.syntax.enumeration.value.enabled.synopsis=Autorise les op\u00e9rations en \u00e9criture pour qu'elles soient effectu\u00e9es dans ce backend (si l'op\u00e9ration requise est valide, l'utilisateur a la permission d'effectuer l'op\u00e9ration, le backend prend en charge ce type d'op\u00e9ration en \u00e9criture, et la propri\u00e9t\u00e9 pour le mode de possibilit\u00e9 d'\u00e9criture globale est aussi activ\u00e9e).
property.writability-mode.syntax.enumeration.value.internal-only.synopsis=Entra\u00eene un \u00e9chec des tentatives d'\u00e9criture externe mais permet les \u00e9critures par r\u00e9plication et les op\u00e9rations internes.
