user-friendly-name=Servidor en segundo plano del controlador del archivo de configuraci\u00f3n.
user-friendly-plural-name=Servidores en segundo plano del controlador del archivo de configuraci\u00f3n.
synopsis=El servidor en segundo plano del controlador del archivo de configuraci\u00f3n permite a los clientes acceder a la configuraci\u00f3n del servidor mediante un protocolo, as\u00ed como realizar operaciones tanto de lectura como de escritura. Nota: las operaciones de modificaci\u00f3n de DN no se admiten en las entradas de la configuraci\u00f3n del servidor.
property.backend-id.synopsis=Especifica un nombre para identificar el segundo plano asociado.
property.backend-id.description=El nombre debe ser exclusivo entre todos los segundos planos del servidor. El Id. de segundo plano no puede alterarse una vez creado en el servidor.
property.base-dn.synopsis=Especifica los DN de base para los datos que controla el servidor en segundo plano.
property.base-dn.description=Un solo servidor en segundo plano puede hacerse cargo de uno o m\u00e1s DN de base. Tenga en cuenta que dos servidores en segundos plano pueden compartir el mismo DN de base, aunque uno de ellos puede tener un DN de base que est\u00e9 por debajo de otro segundo plano (similar al uso de subsufijos en el servidor de directorios de Sun Java System). Si cualquiera de los DN de base est\u00e1 subordinado a otro de otro segundo plano, todos los DN de base de ese segundo plano deber\u00e1n subordinarse al mismo DN de base.
property.base-dn.requires-admin-action.synopsis=No se requiere ninguna medida administrativa predeterminada, aunque puede que se necesiten algunas operaciones en segundo plano antes de que pueda utilizarse un nuevo DN de base.
property.enabled.synopsis=Indica si el segundo plano est\u00e1 habilitado en el servidor.
property.enabled.description=Si no est\u00e1 habilitado un servidor en segundo plano, no se podr\u00e1 acceder a sus contenidos al procesar operaciones. 
property.java-class.synopsis=Especifica el nombre completo de la clase de Java que proporciona la implementaci\u00f3n en segundo plano.
property.writability-mode.synopsis=Especifica la conducta que debe utilizar el segundo plano al procesar operaciones de escritura.
property.writability-mode.syntax.enumeration.value.disabled.synopsis=Provoca que fallen todos los intentos de escritura.
property.writability-mode.syntax.enumeration.value.enabled.synopsis=Permite escribir operaciones para que se lleven a cabo en segundo plano (si la operaci\u00f3n solicitada es v\u00e1lida, el usuario tiene permiso de realizar dicha operaci\u00f3n, el segundo plano admite ese tipo de escritura y se habilita tambi\u00e9n la propiedad del modo de escritura general).
property.writability-mode.syntax.enumeration.value.internal-only.synopsis=Provoca que fallen todos los intentos de escritura externa, pero permite la escritura mediante repetici\u00f3n y las operaciones internas.
