user-friendly-name=Servidor de fondo LDIF
user-friendly-plural-name=Servidores de fondo LDIF
synopsis=El servidor de fondo LDIF proporciona un mecanismo para interactuar con datos almacenados en un archivo LDIF.
description=Se admiten todas las operaciones LDAP b\u00e1sicas en el servidor de fondo LDIF aunque tiene compatibilidad m\u00ednima con los controles personalizados.
property.backend-id.synopsis=Especifica un nombre para identificar el servidor de fondo asociado.
property.backend-id.description=El nombre debe ser \u00fanico entre todos los servidores de fondo del servidor. El Id. del servidor de fondo no se puede modificar una vez creado el servidor de fondo en el servidor.
property.base-dn.synopsis=Especifica el/los DN de base para los datos que el servidor de fondo (backend) controla.
property.base-dn.description=Un \u00fanico servidor de fondo (backend) puede ser responsable de uno o m\u00e1s DN de base. Tenga en cuenta que es posible que ninguno de los dos servidores de fondo (backends) tenga el mismo DN de base aunque un servidor de fondo puede tener un DN de base que sea inferior al proporcionado por otro servidor de fondo (similar al uso de subsufijos en el servidor de directorios Sun Java System). Si cualquiera de los DN de base est\u00e1 subordinado a un DN de base de otro servidor de fondo, todos los DN de base de ese servidor de fondo deben estar subordinados a ese mismo DN de base.
property.base-dn.requires-admin-action.synopsis=No se requiere ninguna acci\u00f3n administrativa de forma predeterminada aunque es posible que sea necesaria alguna acci\u00f3n seg\u00fan cada servidor de fondo antes de que se pueda utilizar el nuevo DN de base.
property.enabled.synopsis=Indica si est\u00e1 habilitado el servidor de fondo en el servidor.
property.enabled.description=Si no est\u00e1 habilitado el servidor de fondo, no se podr\u00e1 acceder a su contenido cuando haya operaciones en procesamiento. 
property.is-private-backend.synopsis=Indica si el servidor de fondo debe considerarse un servidor de fondo privado, que indica que se utiliza para almacenar datos operativos en lugar de informaci\u00f3n definida por el usuario.
property.java-class.synopsis=Especifica el nombre completo de la clase de Java que proporciona la implementaci\u00f3n del servidor de fondo (backend).
property.ldif-file.synopsis=Especifica la ruta al archivo LDIF que contiene los datos de este servidor de fondo.
property.writability-mode.synopsis=Especifica el comportamiento que el servidor de fondo debe tener cuando haya operaciones de escritura en procesamiento.
property.writability-mode.syntax.enumeration.value.disabled.synopsis=Produce que todos los intentos de escritura fallen.
property.writability-mode.syntax.enumeration.value.enabled.synopsis=Permite que se realicen operaciones de escritura en ese servidor de fondo (si la operaci\u00f3n solicitada es v\u00e1lida, el usuario tiene permiso para realizar esa operaci\u00f3n, el servidor de fondo soporta ese tipo de operaci\u00f3n de escritura y tambi\u00e9n est\u00e1 habilitada la propiedad de modo de escritura global).
property.writability-mode.syntax.enumeration.value.internal-only.synopsis=Produce que los intentos de escritura externa fallen pero permite la escritura mediante operaciones internas y de repetici\u00f3n.
