user-friendly-name=Monitoring-Backend
user-friendly-plural-name=Monitoring-Backends
synopsis=Das Monitoring-Backend erm\u00f6glicht Clients den zugriff auf Informationen die von den Directory Server Monitoring-Provideren zur Verf\u00fcgung gestellt werden.
property.backend-id.synopsis=Gibt einen Namen f\u00fcr die Identifizierung einen assoziierten Backends an.
property.backend-id.description=Der Namen muss \u00fcber alle Backends im Server eindeutig sein. Die Backend-ID kann nach Anlegen des Backends im Server nicht mehr ver\u00e4ndert werden.
property.base-dn.synopsis=Gibt die Basis-DNs f\u00fcr die Daten die das Backend verarbeitet an.
property.base-dn.description=Ein Backend kann f\u00fcr ein oderer mehrere Basis-DNs veratnwortlich sein. Beachten sie bitte dass zwei Backends nicht die selbe Basis-DN haben d\u00fcrfen. Davon abgesehen kann ein Backend sehrwohl eine Basis-DN unter einer DN die von einem anderen Backend verwaltet wird verwalten (\u00e4hnlich wie die Benutzung von sub-suffixen im Sun Java System Directory Server). Falls irgendeine Basis-Dn eine untergeorgnete DN einer Basis-Dn die durch ein anderes Backend verwaltet wird ist, dann m\u00fcssen alle Basis-DNs f\u00fcr das Backend zur selben Basis-DN untergeordnet sein.
property.base-dn.requires-admin-action.synopsis=Es ist standardm\u00e4ssig keine Admint\u00e4tigkeit vonn\u00f6ten. Es kann aber sein dass Admint\u00e4tigkeit auf einer pro Backend Basis ben\u00f6tigt wird bevor eine neue Basis-DN benutzt werden kann.
property.enabled.synopsis=Gibt an ob ein Backend im Server aktiviert ist.
property.enabled.description=Falls ein Backend nicht aktiviert ist, steht dessen Inhalt nicht f\u00fcr Verarbeitungen zur Verf\u00fcgung.
property.java-class.synopsis=Gibt den vollqualifizierten Java Klassennamen an der das Backend Implementiert.
property.writability-mode.synopsis=Gibt das Verhalten an das das Backend benutzen soll um Schreiboperationen durchzuf\u00fchren.
property.writability-mode.syntax.enumeration.value.disabled.synopsis=Bewirkt dass alle Schreiboperationen fehlschlagen.
property.writability-mode.syntax.enumeration.value.enabled.synopsis=Erlaubt dass Schreiboperationen im Backend durchgef\u00fchrt werden k\u00f6nnen. Trifft dann zu wenn wenn die angeforderte Operation g\u00fcltig ist, der User berechtigt ist die Operation auszuf\u00fchren, das Backend den Typ von Schreiboperation unterst\u00fctzt und die Globale-Beschreibbarkeitsmodus Eigenschaft (global writability mode property)  aktiviert ist.
property.writability-mode.syntax.enumeration.value.internal-only.synopsis=Bewirkt dass von extern angeforderte Schreiboperationen fehlschlagen, erlaubt aber Schreiboperationen die durch Replikation oder Interneoperationen hervorgerufen wurden.
